{
    "modules": {
        "config": {
            "settings_schema": {
                "locale": {
                    "invalid": "Ongeldige landinstelling. Ondersteunde landinstellingen: {supported}",
                    "description": "Automatische detectie van het taalgebied overschrijven met een specifieke taalgebiedcode"
                },
                "nsfw_pfp_message": {
                    "default": "Uw profielfoto bevat naar schatting expliciete inhoud",
                    "choices": [
                        "Uw profielfoto bevat naar schatting expliciete inhoud",
                        "Uw profielfoto is niet geschikt voor deze server.",
                        "Uw profielfoto is gemarkeerd als NSFW."
                    ]
                },
                "rules": {
                    "default": [
                        "1. Wees respectvol — geen intimidatie of haatzaaiende uitspraken.",
                        "2. Geen NSFW of obscene inhoud.",
                        "3. Geen spam of buitensporige zelfpromotie.",
                        "4. Volg de Servicevoorwaarden van Discord."
                    ],
                    "description": "De serverregels die worden gebruikt voor autonome moderatie."
                },
                "vcmod_rules": {
                    "default": [
                        "1. Geen intimidatie, haatzaaiende uitspraken of bedreigingen.",
                        "2. Geen beledigingen of discriminerende taal.",
                        "3. Geen opruiing tot geweld of illegale activiteiten.",
                        "4. Geen seksuele inhoud of expliciete opmerkingen.",
                        "5. Volg de Servicevoorwaarden van Discord."
                    ]
                },
                "strike-channel": {
                    "description": "Kanaal waar strafpunten worden gelogd."
                },
                "aimod-debug": {
                    "description": "Stuur altijd een gedetailleerd AI-moderatie-debugbericht naar het kanaal voor AI-overtredingen, inclusief gemarkeerde berichten, AI-beslissing, en toegepaste acties."
                },
                "nsfw-verbose": {
                    "description": "Plaats een embed met een gedetailleerd scanrapport in hetzelfde kanaal als de gescande media."
                },
                "nsfw-channel": {
                    "description": "Kanaal waarin NSFW-overtredingen worden gelogd met een voorbeeld van de media."
                },
                "nsfw-channel-notify": {
                    "description": "Stuur een meldings-embed naar het kanaal wanneer NSFW-inhoud wordt verwijderd."
                },
                "nsfw-enabled": {
                    "description": "Schakel NSFW-scanning voor berichten, reacties, en avatars in (andere schakelaars blijven van toepassing)."
                },
                "monitor-events": {
                    "description": "Logging in- of uitschakelen voor elk type bewaakte gebeurtenis."
                },
                "nsfw-detection-action": {
                    "description": "Actie die moet worden uitgevoerd wanneer een gebruiker NSFW-content plaatst."
                },
                "nsfw-detection-categories": {
                    "description": "Categorieën die voor detectie als NSFW worden beschouwd."
                },
                "nsfw-high-accuracy": {
                    "description": "Schakel NSFW-scans met hoge nauwkeurigheid in voor betrouwbaardere detectie. Alleen versneld."
                },
                "threshold": {
                    "description": "Drempel voor de betrouwbaarheid van NSFW-detectie. Lagere waarden zijn gevoeliger."
                },
                "banned-words-action": {
                    "description": "Actie die moet worden uitgevoerd wanneer een gebruiker een verboden woord plaatst."
                },
                "monitor-channel": {
                    "description": "Kanaal om alle serveractiviteiten te loggen, inclusief bewerkingen en verwijderingen van berichten en gebeurtenissen waarbij gebruikers de server betreden of verlaten."
                },
                "captcha-log-channel": {
                    "description": "Kanaal waar captcha-verificatielogboeken en activiteitsupdates worden geplaatst."
                },
                "aimod-channel": {
                    "description": "Kanaal waar AI-overtredingslogberichten worden geplaatst."
                },
                "cycle-strike-actions": {
                    "description": "Doorloop strike-acties wanneer er geen acties meer beschikbaar zijn om aan een gebruiker te geven."
                },
                "exclude-bannedwords-channels": {
                    "description": "Kanalen om uit te sluiten van detectie van verboden woorden."
                },
                "strike-actions": {
                    "description": "Acties om te nemen voor elk strikeniveau."
                },
                "strike-expiry": {
                    "description": "Tijd dat een strike duurt. Gebruik formaten zoals 20s, 30m, 2h, 30d, 2w, 5mo, 1y. Seconden, minuten, uren, dagen, weken, maanden en jaren respectievelijk."
                },
                "dm-on-strike": {
                    "description": "DM de gebruiker wanneer deze een strike ontvangt."
                },
                "check-pfp": {
                    "description": "Controleer de profielfoto van de gebruiker op NSFW-inhoud."
                },
                "nsfw-pfp-action": {
                    "description": "Actie die moet worden uitgevoerd wanneer een gebruiker een NSFW-profielfoto instelt."
                },
                "nsfw-pfp-message": {
                    "description": "Het bericht dat wordt verzonden wanneer de profielfoto van een speler is gemarkeerd.",
                    "default": "Er is gedetecteerd dat je profielfoto expliciete inhoud bevat",
                    "choices": [
                        "Er is gedetecteerd dat je profielfoto expliciete inhoud bevat",
                        "Je profielfoto is niet geschikt voor deze server.",
                        "Je profielfoto is gemarkeerd als NSFW."
                    ]
                },
                "unmute-on-safe-pfp": {
                    "description": "Verwijder de time-out van een gebruiker zodra de profielfoto is gewijzigd naar iets passends."
                },
                "scan-age-restricted": {
                    "description": "Scan leeftijdsbeperkte (NSFW) kanalen. Wanneer uitgeschakeld, worden NSFW-kanalen overgeslagen."
                },
                "check-tenor-gifs": {
                    "description": "Sancties toepassen wanneer NSFW-inhoud wordt gedetecteerd in Tenor GIFs."
                },
                "use-default-banned-words": {
                    "description": "Gebruik de ingebouwde lijst met ongepaste woorden voor deze server."
                },
                "exclude-channels": {
                    "description": "Kanalen om uit te sluiten van detectie."
                },
                "delete-scam-messages": {
                    "description": "Verwijder automatisch berichten die overeenkomen met oplichtingspatronen of URL's."
                },
                "scam-detection-action": {
                    "description": "Actie die moet worden ondernomen wanneer een oplichtingsbericht wordt gedetecteerd."
                },
                "check-links": {
                    "description": "Controleer links in berichten op malware, phishing, oplichting, enz."
                },
                "exclude-scam-channels": {
                    "description": "Kanalen om uit te sluiten van oplichtingsdetectie."
                },
                "aimod-detection-action": {
                    "description": "Actie die moet worden ondernomen wanneer de autonome moderator een overtreding detecteert. Gebruik auto zodat de AI de beslissing neemt."
                },
                "aimod-high-accuracy": {
                    "description": "Gebruik nauwkeurigere AI-moderatie met gpt-5-mini (ca. 2.25 USD per 1M tokens). Verbruikt het maandelijkse budget sneller dan de standaard."
                },
                "autonomous-mod": {
                    "description": "Gebruik AI om de hele server automatisch te modereren."
                },
                "aimod-check-interval": {
                    "description": "Hoe vaak het batchproces voor AI-moderatie moet worden uitgevoerd."
                },
                "aimod-mode": {
                    "description": "Kies hoe AI-moderatie wordt geactiveerd: modus `report` (alleen bij vermelding), modus `interval` (automatische achtergrondscan), of modus `adaptive` (schakelt dynamisch op basis van serveractiviteit, gebeurtenissen of configuratie)."
                },
                "aimod-adaptive-events": {
                    "description": "Configureer welke gebeurtenissen het schakelen tussen AI-moderatiemodi activeren."
                },
                "no-forward-from-role": {
                    "description": "Voorkom dat een specifieke rol berichten doorstuurt."
                },
                "banned-urls": {
                    "description": "Exacte URL's of domeinen om te blokkeren."
                },
                "url-detection-action": {
                    "description": "Actie die moet worden ondernomen wanneer een geblokkeerde URL wordt gedetecteerd."
                },
                "exclude-url-channels": {
                    "description": "Kanalen om uit te sluiten van verboden URL's."
                },
                "vcmod-enabled": {
                    "description": "Schakel moderatie en transcriptie voor spraakkanalen in."
                },
                "vcmod-channels": {
                    "description": "Spraakkanalen om te monitoren (indien leeg, wordt geen enkel kanaal gemonitord)."
                },
                "vcmod-listen-duration": {
                    "description": "Hoelang er tijdens een cyclus per spraakkanaal actief wordt meegeluisterd (bijv. 2m, 5m)."
                },
                "vcmod-idle-duration": {
                    "description": "Hoelang er wordt gepauzeerd tussen elke transcriptie in Saver Mode."
                },
                "vcmod-saver-mode": {
                    "description": "Besparingsmodus: de bot wisselt tussen VC's om actief te lijken, maar neemt het grootste deel van de tijd niet op en luistert ook niet."
                },
                "vcmod-rules": {
                    "description": "Regels die worden toegepast op moderatie van spraakchat (afzonderlijk van tekstregels).",
                    "default": [
                        "1. Geen intimidatie, haatdragende taal of bedreigingen.",
                        "2. Geen scheldwoorden of discriminerende taal.",
                        "3. Geen aanzetten tot geweld of illegale activiteiten.",
                        "4. Geen seksuele inhoud of expliciete opmerkingen.",
                        "5. Volg de Servicevoorwaarden van Discord."
                    ]
                },
                "vcmod-detection-action": {
                    "description": "Actie die moet worden ondernomen wanneer VC-moderatie een overtreding detecteert. Gebruik auto zodat de AI beslist."
                },
                "vcmod-high-accuracy": {
                    "description": "Gebruik AI-analyse met hogere nauwkeurigheid voor VC-moderatie (gebruikt meer tokenbudget)."
                },
                "vcmod-high-quality-transcription": {
                    "description": "Schakel duidelijkere spraaktranscripties in met premiumverwerking (hogere kosten)."
                },
                "vcmod-transcript-channel": {
                    "description": "Kanaal waar VC-transcripties worden geplaatst."
                },
                "vcmod-transcript-only": {
                    "description": "Wanneer ingeschakeld, transcribeert de bot alleen spraakchat zonder AI-regelcontroles of moderatieacties toe te passen. Dit verlaagt het budgetverbruik aanzienlijk."
                },
                "captcha-verification-enabled": {
                    "description": "Vereis dat nieuwkomers een captcha-uitdaging voltooien voordat ze toegang krijgen."
                },
                "captcha-grace-period": {
                    "description": "Hoe lang nieuwkomers hebben om de captcha-verificatie te voltooien (bijv. 10m, 1h)."
                },
                "captcha-success-actions": {
                    "description": "Acties die automatisch worden uitgevoerd na succesvolle verificatie."
                },
                "captcha-delivery-method": {
                    "description": "Hoe links voor captcha-verificatie aan nieuwe leden worden geleverd (DM of embed)."
                },
                "captcha-embed-channel-id": {
                    "description": "Kanaal waar de captcha-verificatie-embed wordt geplaatst bij levering via embed."
                },
                "pre-captcha-roles": {
                    "description": "Rollen die aan nieuwkomers worden toegewezen voordat ze de captcha-verificatie voltooien."
                },
                "captcha-failure-actions": {
                    "description": "Acties die automatisch worden uitgevoerd wanneer een lid de captcha-verificatie niet doorstaat."
                }
            }
        }
    }
}
