{
  "cogs": {
    "api_pool": {
      "meta": {
        "group_description": "Gerenciamento das suas chaves de API pessoais no pool.",
        "explain": {
          "description": "Explique o pool de API."
        },
        "add": {
          "description": "Adicione uma chave de API ao pool.",
          "params": {
            "api_key": "A chave API da OpenAI para adicionar ao pool compartilhado."
          }
        },
        "remove": {
          "description": "Remova uma chave de API do pool.",
          "params": {
            "api_key": "A chave API da OpenAI para remover do pool compartilhado."
          }
        },
        "clear": {
          "description": "Limpe todas as suas chaves de API do pool."
        },
        "list": {
          "description": "Liste todas as chaves de API no seu pool (criptografadas)."
        }
      },
      "explanation": {
        "body": "**O que é o API Pool?**\nO API Pool é uma coleção segura e anônima de chaves de API da OpenAI compartilhadas. Ele permite que o Bot Moderador continue operando efetivamente, mesmo quando os usuários individuais enfrentam limites de taxa.\n\n**Como funciona?**\n- Quando você adiciona sua chave de API da OpenAI ao pool, ela é criptografada e armazenada com segurança.\n- O bot usa essas chaves exclusivamente para acessar os modelos da OpenAI e realizar tarefas de moderação.\n- Sua chave de API permanece confidencial; ninguém, incluindo os desenvolvedores do bot, pode visualizá-la.\n- Você tem controle total e pode remover sua chave de API do pool a qualquer momento.\n\n**Importante:** Para contribuir com sua chave de API, sua conta OpenAI deve ter pelo menos $5 em créditos pré-pagos. Embora o terminal de moderação seja gratuito, a OpenAI exige que as contas tenham detalhes de cobrança ativos e cota. Você pode adicionar crédito à sua conta aqui: <https://platform.openai.com/account/billing/overview>\n\nAo contribuir com sua chave de API, você ajuda a garantir que o Bot Moderador permaneça responsivo e eficaz para todos os usuários."
      },
      "add": {
        "invalid": "{erro}",
        "duplicate": "Esta chave de API já existe no pool.",
        "success": "Chave de API adicionada ao pool."
      },
      "remove": {
        "success": "Chave de API removida do seu pool.",
        "missing": "Esta chave de API não foi encontrada no seu pool. Use /api_pool list para ver suas chaves de API atuais."
      },
      "clear": {
        "success": "Todas as chaves de API foram limpas do seu pool.",
        "empty": "Nenhuma chave de API encontrada para limpar."
      },
      "list": {
        "header": "Suas Chaves de API:",
        "empty": "Nenhuma chave de API encontrada no seu pool."
      }
    }
  }
}
