{
  "cogs": {
    "api_pool": {
      "meta": {
        "group_description": "Management of your personal API keys in the pool.",
        "explain": {
          "description": "Explain the API pool."
        },
        "add": {
          "description": "Add an API key to the pool.",
          "params": {
            "api_key": "The OpenAI API key to add to the shared pool."
          }
        },
        "remove": {
          "description": "Remove an API key from the pool.",
          "params": {
            "api_key": "The OpenAI API key to remove from the shared pool."
          }
        },
        "clear": {
          "description": "Clear all your API keys from the pool."
        },
        "list": {
          "description": "List all API keys in your pool (encrypted)."
        }
      },
      "explanation": {
        "body": "**What is the API Pool?**\nThe API Pool is a secure and anonymous collection of shared OpenAI API keys. It enables Moderator Bot to continue operating effectively, even when individual users face rate limits.\n\n**How does it work?**\n- When you add your OpenAI API key to the pool, it's encrypted and stored securely.\n- The bot uses these keys exclusively for accessing OpenAI models to perform moderation tasks.\n- Your API key remains confidential; no one, including the bot developers, can view it.\n- You have full control and can remove your API key from the pool at any time.\n\n**Important:** To contribute your API key, your OpenAI account must have at least $5 in prepaid credits. Even though the moderation endpoint is free to use, OpenAI requires accounts to have active billing details and quota. You can add credit to your account here: <https://platform.openai.com/account/billing/overview>\n\nBy contributing your API key, you help ensure that Moderator Bot remains responsive and effective for all users."
      },
      "add": {
        "invalid": "{error}",
        "duplicate": "This API key already exists in the pool.",
        "success": "API key added to the pool."
      },
      "remove": {
        "success": "API key removed from your pool.",
        "missing": "This API key was not found in your pool. Use /api_pool list to see your current API keys."
      },
      "clear": {
        "success": "All API keys have been cleared from your pool.",
        "empty": "No API keys found to clear."
      },
      "list": {
        "header": "Your API Keys:",
        "empty": "No API keys found in your pool."
      },
      "disabled": "⚠️ The API pool is disabled because this bot isn't configured with the FERNET_SECRET_KEY environment variable. Set it to manage shared OpenAI API keys."
    }
  }
}
