{
  "cogs": {
    "strikes": {
      "strike": {
        "error": "A apărut o eroare, vă rugăm să încercați din nou. Dacă problema persistă, vă rugăm să vă alăturați serverului de suport (link în `/help`)."
      },
      "get": {
        "title": "Strikes pentru {name}",
        "empty": "Nu s-au găsit strikes pentru acest utilizator.",
        "file_notice": "Lista de strikes este prea lungă pentru a fi afișată inline, va fi trimisă ca un fișier:"
      },
      "remove": {
        "success": "Strike-ul cu ID-ul `{id}` pentru {mention} a fost eliminat cu succes.",
        "not_found": "Nu a fost găsit niciun strike cu ID-ul `{id}` pentru {mention} în acest guild.\nFolosiți `/strikes get <user>` pentru a afișa toate strikes și ID-urile lor."
      },
      "clear": {
        "none": "Nu s-au găsit strikes active pentru {mention}.",
        "success": "Au fost șterse {count} strike-uri pentru {mention}."
      },
      "actions": {
        "exists": "Acțiunea `{action}` există deja pentru strikes de tip `{key}`.",
        "added": "Acțiunea `{action}` a fost adăugată la strikes de tip `{key}`.",
        "missing": "Acțiunea `{action}` nu a fost găsită pentru strikes de tip `{key}`.",
        "removed": "Acțiunea `{action}` a fost eliminată din strikeurile de tip `{key}`."
      },
      "view_actions": {
        "none": "Nu sunt configurate acțiuni de strike.",
        "heading": "**Acțiuni curente de strike:**",
        "item": "{key}: {actions}"
      },
      "intimidate": {
        "user_title": "Avertisment final pentru {name}",
        "user_body": "{mention},\nAcțiunile tale depășesc limitele a ceea ce este acceptabil pe acest server. Consideră aceasta avertismentul tău final înainte de a se aplica un strike contului tău. Nerespectarea în continuare a regulilor comunității va duce la măsuri disciplinare imediate, care pot include sancțiuni suplimentare sau eliminarea de pe server.\n\nAcesta nu este o cerere — respectați regulile acum.",
        "guild_title": "Notificare oficială de moderare",
        "guild_body": "Vă rugăm să fiți informați că Moderator Bot monitorizează activ toată activitatea din acest canal. Orice încălcare a regulilor comunității poate duce la măsuri disciplinare. Severitatea și natura acestor măsuri vor depinde de circumstanțele fiecărui caz. Apreciem cooperarea dumneavoastră în menținerea unui mediu respectuos și sigur.",
        "confirm": "Mesaj trimis."
      }
    }
  }
}
