{
  "cogs": {
    "api_pool": {
      "meta": {
        "group_description": "Gestió de les teves claus API personals a la piscina.",
        "explain": {
          "description": "Explica la piscina d'API."
        },
        "add": {
          "description": "Afegeix una clau API a la piscina.",
          "params": {
            "api_key": "La clau API d'OpenAI a afegir compartida a la piscina."
          }
        },
        "remove": {
          "description": "Elimina una clau API de la piscina.",
          "params": {
            "api_key": "La clau API d'OpenAI a eliminar de la piscina compartida."
          }
        },
        "clear": {
          "description": "Neteja totes les teves claus API de la piscina."
        },
        "list": {
          "description": "Llista totes les claus API a la teva piscina (xifrat)."
        }
      },
      "explanation": {
        "body": "**Què és l'API Pool?**\nL'API Pool és una col·lecció segura i anònima de claus API compartides d'OpenAI. Permet que el bot moderador continuï funcionant eficaçment, fins i tot quan els usuaris individuals es troben amb límits de taxa.\n\n**Com funciona?**\n- Quan afegeixes la teva clau API d'OpenAI a la piscina, aquesta s'encripta i s'emmagatzema de manera segura.\n- El bot utilitza aquestes claus exclusivament per accedir als models d'OpenAI per realitzar tasques de moderació.\n- La teva clau API es manté confidencial; ningú, inclosos els desenvolupadors del bot, pot veure-la.\n- Tens el control total i en qualsevol moment pots eliminar la teva clau API de la piscina.\n\n**Important:** Per contribuir amb la teva clau API, el teu compte d'OpenAI ha de tenir almenys 5 $ en crèdits prepagats. Tot i que el punt d'accés de moderació és gratuït, OpenAI requereix que els comptes tinguin dades de facturació i quota actives. Pots afegir crèdit al teu compte aquí: <https://platform.openai.com/account/billing/overview>\n\nContribuint amb la teva clau API, ajudes a garantir que el bot moderador segueixi sent receptiu i efectiu per a tots els usuaris."
      },
      "add": {
        "invalid": "{error}",
        "duplicate": "Aquesta clau API ja existeix a la piscina.",
        "success": "Clau API afegida a la piscina."
      },
      "remove": {
        "success": "Clau API eliminada de la teva piscina.",
        "missing": "Aquesta clau API no es va trobar a la teva piscina. Utilitza /api_pool list per veure les teves claus API actuals."
      },
      "clear": {
        "success": "Totes les claus API han estat esborrades de la teva piscina.",
        "empty": "No es van trobar claus API per esborrar."
      },
      "list": {
        "header": "Les teves claus API:",
        "empty": "No s'han trobat claus API a la teva piscina."
      }
    }
  }
}
