{
  "cogs": {
    "api_pool": {
      "meta": {
        "group_description": "Διαχείριση των προσωπικών κλειδιών API σας στην πισίνα.",
        "explain": {
          "description": "Εξηγήστε την πισίνα API."
        },
        "add": {
          "description": "Προσθέστε ένα κλειδί API στην πισίνα.",
          "params": {
            "api_key": "Το κλειδί API του OpenAI που θα προστεθεί στην κοινόχρηστη πισίνα."
          }
        },
        "remove": {
          "description": "Αφαιρέστε ένα κλειδί API από την πισίνα.",
          "params": {
            "api_key": "Το κλειδί API του OpenAI που θα αφαιρεθεί από την κοινόχρηστη πισίνα."
          }
        },
        "clear": {
          "description": "Διαγράψτε όλα τα κλειδιά API σας από την πισίνα."
        },
        "list": {
          "description": "Λίστα όλων των κλειδιών API στην πισίνα σας (κρυπτογραφημένα)."
        }
      },
      "explanation": {
        "body": "**Τι είναι το API Pool?**\nΤο API Pool είναι μια ασφαλής και ανώνυμη συλλογή κοινών κλειδιών API του OpenAI. Επιτρέπει στο Moderator Bot να συνεχίσει να λειτουργεί αποτελεσματικά, ακόμα και όταν οι μεμονωμένοι χρήστες αντιμετωπίζουν όρια ρυθμού.\n\n**Πώς λειτουργεί;**\n- Όταν προσθέτετε το κλειδί API του OpenAI στο pool, κρυπτογραφείται και αποθηκεύεται με ασφάλεια.\n- Το bot χρησιμοποιεί αυτά τα κλειδιά αποκλειστικά για την πρόσβαση σε μοντέλα OpenAI για την εκτέλεση εργασιών μέτριας.\n- Το κλειδί API σας παραμένει εμπιστευτικό, κανείς, συμπεριλαμβανομένων των προγραμματιστών bot, δεν μπορεί να το δει.\n- Έχετε πλήρη έλεγχο και μπορείτε να αφαιρέσετε το κλειδί API από το pool ανά πάσα στιγμή.\n\n**Σημαντικό:** Για να συνεισφέρετε το κλειδί API σας, ο λογαριασμός σας OpenAI πρέπει να έχει τουλάχιστον 5$ σε προπληρωμένες μονάδες. Αν και το σημείο τερματικού moderation είναι δωρεάν για χρήση, το OpenAI απαιτεί λογαριασμούς με ενεργές λεπτομέρειες χρέωσης και όριο χρήσης. Μπορείτε να προσθέσετε μονάδες στον λογαριασμό σας εδώ: <https://platform.openai.com/account/billing/overview>\n\nΣυνεισφέροντας το κλειδί API σας, βοηθάτε να παραμείνει ο Moderator Bot ευέλικτος και αποτελεσματικός για όλους τους χρήστες."
      },
      "add": {
        "invalid": "{error}",
        "duplicate": "Αυτό το κλειδί API υπάρχει ήδη στο pool.",
        "success": "Το κλειδί API προστέθηκε στο pool."
      },
      "remove": {
        "success": "Το κλειδί API αφαιρέθηκε από το pool σας.",
        "missing": "Δεν βρέθηκε το κλειδί API στο pool σας. Χρησιμοποιήστε το /api_pool list για να δείτε τα τρέχοντα κλειδιά API σας."
      },
      "clear": {
        "success": "Όλα τα κλειδιά API έχουν διαγραφεί από το pool σας.",
        "empty": "Δεν βρέθηκαν κλειδιά API για διαγραφή."
      },
      "list": {
        "header": "Τα κλειδιά API σας:",
        "empty": "Δεν βρέθηκαν κλειδιά API στο pool σας."
      }
    }
  }
}
