{
    "modules": {
        "config": {
            "settings_schema": {
                "locale": {
                    "invalid": "Μη έγκυρη τοπική ρύθμιση. Υποστηριζόμενες τοπικές ρυθμίσεις: {supported}",
                    "description": "Παράκαμψε την αυτόματη ανίχνευση τοπικής ρύθμισης με συγκεκριμένο κωδικό τοπικής ρύθμισης."
                },
                "nsfw_pfp_message": {
                    "default": "Η εικόνα προφίλ σας ανιχνεύθηκε να περιέχει άσεμνο περιεχόμενο",
                    "choices": [
                        "Η εικόνα προφίλ σας ανιχνεύθηκε να περιέχει άσεμνο περιεχόμενο",
                        "Η εικόνα προφίλ σας δεν είναι κατάλληλη για αυτόν τον διακομιστή.",
                        "Η εικόνα προφίλ σας έχει χαρακτηριστεί ως NSFW."
                    ]
                },
                "rules": {
                    "default": [
                        "1. Δείξτε σεβασμό — χωρίς παρενόχληση ή λόγο μίσους.",
                        "2. Όχι NSFW ή προσβλητικό περιεχόμενο.",
                        "3. Όχι spam ή υπερβολική αυτοπροβολή.",
                        "4. Ακολουθήστε τους Όρους Υπηρεσίας του Discord."
                    ],
                    "description": "Οι κανόνες του διακομιστή που χρησιμοποιούνται για αυτόνομη εποπτεία."
                },
                "vcmod_rules": {
                    "default": [
                        "1. Όχι παρενόχληση, λόγος μίσους ή απειλές.",
                        "2. Όχι προσβλητική ή διακριτή γλώσσα.",
                        "3. Όχι υποκίνηση σε βία ή παράνομη δραστηριότητα.",
                        "4. Όχι σεξουαλικό περιεχόμενο ή άσεμνες παρατηρήσεις.",
                        "5. Ακολουθήστε τους Όρους Υπηρεσίας του Discord."
                    ]
                },
                "strike-channel": {
                    "description": "Κανάλι όπου καταγράφονται οι ποινές."
                },
                "aimod-debug": {
                    "description": "Να αποστέλλεται πάντα αναλυτικό μήνυμα αποσφαλμάτωσης συντονισμού AI στο κανάλι παραβιάσεων AI, που περιλαμβάνει τα επισημασμένα μηνύματα, την απόφαση της AI και τις εφαρμοσμένες ενέργειες."
                },
                "nsfw-verbose": {
                    "description": "Δημοσίευσε ενσωματωμένο μήνυμα με λεπτομερή αναφορά σάρωσης στο ίδιο κανάλι με τα σαρωμένα πολυμέσα."
                },
                "nsfw-channel": {
                    "description": "Κανάλι όπου καταγράφονται παραβιάσεις NSFW με προεπισκόπηση των πολυμέσων."
                },
                "nsfw-channel-notify": {
                    "description": "Στείλε ενσωματωμένο μήνυμα ειδοποίησης στο κανάλι όταν αφαιρείται περιεχόμενο NSFW."
                },
                "nsfw-enabled": {
                    "description": "Ενεργοποίησε σάρωση NSFW για μηνύματα, αντιδράσεις και εικονίδια προφίλ (οι άλλες ρυθμίσεις εξακολουθούν να ισχύουν)."
                },
                "monitor-events": {
                    "description": "Ενεργοποίηση/απενεργοποίηση καταγραφής για κάθε τύπο παρακολουθούμενου συμβάντος."
                },
                "nsfw-detection-action": {
                    "description": "Ενέργεια που θα ληφθεί όταν ένας χρήστης δημοσιεύει περιεχόμενο NSFW."
                },
                "nsfw-detection-categories": {
                    "description": "Κατηγορίες που θεωρούνται NSFW για ανίχνευση."
                },
                "nsfw-high-accuracy": {
                    "description": "Ενεργοποίησε σαρώσεις NSFW υψηλής ακρίβειας για πιο αξιόπιστη ανίχνευση. Μόνο με επιτάχυνση."
                },
                "threshold": {
                    "description": "Κατώφλι εμπιστοσύνης για την ανίχνευση NSFW. Χαμηλότερες τιμές είναι πιο ευαίσθητες."
                },
                "banned-words-action": {
                    "description": "Ενέργεια που θα ληφθεί όταν ένας χρήστης δημοσιεύει απαγορευμένη λέξη."
                },
                "monitor-channel": {
                    "description": "Κανάλι για την καταγραφή όλων των δραστηριοτήτων του διακομιστή, συμπεριλαμβανομένων επεξεργασιών μηνυμάτων, διαγραφών και συμβάντων εισόδου/αποχώρησης χρηστών."
                },
                "captcha-log-channel": {
                    "description": "Κανάλι όπου δημοσιεύονται καταγραφές επαλήθευσης captcha και ενημερώσεις δραστηριότητας."
                },
                "aimod-channel": {
                    "description": "Κανάλι όπου δημοσιεύονται καταγραφές παραβιάσεων AI."
                },
                "cycle-strike-actions": {
                    "description": "Κάνε κυκλική εναλλαγή στις ενέργειες ποινής όταν δεν απομένουν άλλες για έναν χρήστη."
                },
                "exclude-bannedwords-channels": {
                    "description": "Κανάλια προς εξαίρεση από την ανίχνευση απαγορευμένων λέξεων."
                },
                "strike-actions": {
                    "description": "Ενέργειες που θα ληφθούν για κάθε επίπεδο ποινής."
                },
                "strike-expiry": {
                    "description": "Διάρκεια μιας ποινής. Χρησιμοποίησε μορφές όπως 20s, 30m, 2h, 30d, 2w, 5mo, 1y. Δευτερόλεπτα, λεπτά, ώρες, ημέρες, εβδομάδες, μήνες και έτη αντίστοιχα."
                },
                "dm-on-strike": {
                    "description": "Αποστολή DM στον χρήστη όταν λαμβάνει ποινή."
                },
                "check-pfp": {
                    "description": "Έλεγχος της εικόνας προφίλ του χρήστη για NSFW περιεχόμενο."
                },
                "nsfw-pfp-action": {
                    "description": "Ενέργεια που θα ληφθεί όταν ένας χρήστης ορίσει NSFW εικόνα προφίλ."
                },
                "nsfw-pfp-message": {
                    "description": "Το μήνυμα που θα σταλεί όταν η εικόνα προφίλ ενός παίκτη έχει επισημανθεί.",
                    "default": "Η εικόνα προφίλ σας εντοπίστηκε ότι περιέχει ακατάλληλο περιεχόμενο",
                    "choices": [
                        "Η εικόνα προφίλ σας εντοπίστηκε ότι περιέχει ακατάλληλο περιεχόμενο",
                        "Η εικόνα προφίλ σας δεν είναι κατάλληλη για αυτόν τον διακομιστή.",
                        "Η εικόνα προφίλ σας έχει επισημανθεί ως NSFW."
                    ]
                },
                "unmute-on-safe-pfp": {
                    "description": "Αφαίρεση του timeout ενός χρήστη μόλις αλλάξει την εικόνα προφίλ του σε κάτι κατάλληλο."
                },
                "scan-age-restricted": {
                    "description": "Σάρωση καναλιών με περιορισμό ηλικίας (NSFW). Όταν είναι απενεργοποιημένο, τα κανάλια NSFW παραλείπονται."
                },
                "check-tenor-gifs": {
                    "description": "Εφαρμογή ποινών όταν εντοπίζεται NSFW περιεχόμενο σε GIF του Tenor."
                },
                "use-default-banned-words": {
                    "description": "Χρήση της ενσωματωμένης λίστας βωμολοχιών για αυτόν τον διακομιστή."
                },
                "exclude-channels": {
                    "description": "Κανάλια προς εξαίρεση από την ανίχνευση."
                },
                "delete-scam-messages": {
                    "description": "Αυτόματη διαγραφή μηνυμάτων που ταιριάζουν με μοτίβα ή URL απάτης."
                },
                "scam-detection-action": {
                    "description": "Ενέργεια που θα ληφθεί όταν εντοπιστεί μήνυμα απάτης."
                },
                "check-links": {
                    "description": "Έλεγχος συνδέσμων στα μηνύματα για κακόβουλο λογισμικό, phishing, απάτες κ.λπ."
                },
                "exclude-scam-channels": {
                    "description": "Κανάλια προς εξαίρεση από την ανίχνευση απάτης."
                },
                "aimod-detection-action": {
                    "description": "Ενέργεια που θα ληφθεί όταν ο αυτόνομος συντονιστής εντοπίζει παράβαση. Χρησιμοποιήστε auto για να λαμβάνει η AI την απόφαση."
                },
                "aimod-high-accuracy": {
                    "description": "Χρήση εποπτείας AI υψηλότερης ακρίβειας με gpt-5-mini (περίπου 2,25 USD ανά 1M tokens). Καταναλώνει τον μηνιαίο προϋπολογισμό ταχύτερα σε σχέση με την προεπιλογή."
                },
                "autonomous-mod": {
                    "description": "Χρησιμοποιήστε AI για αυτόματο συντονισμό ολόκληρου του διακομιστή σας."
                },
                "aimod-check-interval": {
                    "description": "Κάθε πότε να εκτελείται η διαδικασία παρτίδας συντονισμού με AI."
                },
                "aimod-mode": {
                    "description": "Επιλέξτε πώς ενεργοποιείται ο συντονισμός με AI: λειτουργία `report` (μόνο με αναφορά), λειτουργία `interval` (αυτόματη σάρωση στο παρασκήνιο), ή λειτουργία `adaptive` (αλλάζει δυναμικά με βάση τη δραστηριότητα του διακομιστή, τα συμβάντα ή τις ρυθμίσεις)."
                },
                "aimod-adaptive-events": {
                    "description": "Ρυθμίστε ποια συμβάντα ενεργοποιούν την εναλλαγή λειτουργιών συντονισμού AI."
                },
                "no-forward-from-role": {
                    "description": "Αποτρέψτε έναν συγκεκριμένο ρόλο από το να προωθεί μηνύματα."
                },
                "banned-urls": {
                    "description": "Ακριβή URL ή domains για αποκλεισμό."
                },
                "url-detection-action": {
                    "description": "Ενέργεια όταν εντοπιστεί αποκλεισμένο URL."
                },
                "exclude-url-channels": {
                    "description": "Κανάλια που θα εξαιρεθούν από τα απαγορευμένα URL."
                },
                "vcmod-enabled": {
                    "description": "Ενεργοποιήστε τον συντονισμό και την απομαγνητοφώνηση στα φωνητικά κανάλια."
                },
                "vcmod-channels": {
                    "description": "Φωνητικά κανάλια για παρακολούθηση (αν είναι κενό, δεν παρακολουθείται κανένα)."
                },
                "vcmod-listen-duration": {
                    "description": "Διάρκεια ενεργής ακρόασης ανά φωνητικό κανάλι σε κάθε κύκλο (π.χ. 2m, 5m)."
                },
                "vcmod-idle-duration": {
                    "description": "Διάρκεια παύσης μεταξύ κάθε απομαγνητοφώνησης στη Λειτουργία Εξοικονόμησης."
                },
                "vcmod-saver-mode": {
                    "description": "Λειτουργία Εξοικονόμησης: το bot εναλλάσσεται μεταξύ φωνητικών καναλιών για να φαίνεται ενεργό, αλλά δεν καταγράφει ούτε ακούει το μεγαλύτερο μέρος του χρόνου."
                },
                "vcmod-rules": {
                    "description": "Κανόνες που εφαρμόζονται στον συντονισμό φωνητικής συνομιλίας (ξεχωριστά από τους κανόνες κειμένου).",
                    "default": [
                        "1. Όχι παρενόχληση, ρητορική μίσους ή απειλές.",
                        "2. Όχι υβριστικοί ή ρατσιστικοί χαρακτηρισμοί.",
                        "3. Όχι υποκίνηση σε βία ή παράνομη δραστηριότητα.",
                        "4. Όχι σεξουαλικό περιεχόμενο ή απρεπή σχόλια.",
                        "5. Τηρείτε τους Όρους Παροχής Υπηρεσιών του Discord."
                    ]
                },
                "vcmod-detection-action": {
                    "description": "Ενέργεια όταν ο συντονισμός φωνητικών καναλιών εντοπίζει παράβαση. Χρησιμοποιήστε auto για να αποφασίζει το AI."
                },
                "vcmod-high-accuracy": {
                    "description": "Χρήση ανάλυσης ΤΝ υψηλότερης ακρίβειας για την εποπτεία VC (χρησιμοποιεί περισσότερα tokens)."
                },
                "vcmod-high-quality-transcription": {
                    "description": "Ενεργοποίηση πιο καθαρών μεταγραφών φωνής με premium επεξεργασία (υψηλότερο κόστος)."
                },
                "vcmod-transcript-channel": {
                    "description": "Κανάλι όπου δημοσιεύονται οι μεταγραφές VC."
                },
                "vcmod-transcript-only": {
                    "description": "Όταν είναι ενεργό, το bot θα μεταγράφει μόνο το VC χωρίς να εφαρμόζει ελέγχους κανόνων με ΤΝ ή ενέργειες εποπτείας. Αυτό μειώνει σημαντικά τη χρήση προϋπολογισμού."
                },
                "captcha-verification-enabled": {
                    "description": "Απαίτηση ολοκλήρωσης captcha από τους νεοεισερχόμενους πριν αποκτήσουν πρόσβαση."
                },
                "captcha-grace-period": {
                    "description": "Διάρκεια που έχουν οι νεοεισερχόμενοι για να ολοκληρώσουν την επαλήθευση captcha (π.χ. 10m, 1h)."
                },
                "captcha-success-actions": {
                    "description": "Ενέργειες που εκτελούνται αυτόματα μετά από επιτυχή επαλήθευση."
                },
                "captcha-delivery-method": {
                    "description": "Τρόπος παράδοσης των συνδέσμων επαλήθευσης captcha στα νέα μέλη (DM ή embed)."
                },
                "captcha-embed-channel-id": {
                    "description": "Κανάλι όπου δημοσιεύεται το embed επαλήθευσης captcha όταν χρησιμοποιείται παράδοση μέσω embed."
                },
                "pre-captcha-roles": {
                    "description": "Ρόλοι που αποδίδονται στους νεοεισερχόμενους πριν ολοκληρώσουν την επαλήθευση captcha."
                },
                "captcha-failure-actions": {
                    "description": "Ενέργειες που εκτελούνται αυτόματα όταν ένα μέλος αποτύχει στην επαλήθευση captcha."
                }
            }
        }
    }
}
