{
  "cogs": {
    "api_pool": {
      "meta": {
        "group_description": "Управљање вашим личним API кључевима у базену.",
        "explain": {
          "description": "Објасни API базен."
        },
        "add": {
          "description": "Додај API кључ у базен.",
          "params": {
            "api_key": "OpenAI API кључ за додавање у дељени базен."
          }
        },
        "remove": {
          "description": "Уклони API кључ из базена.",
          "params": {
            "api_key": "OpenAI API кључ за уклањање из дељеног базена."
          }
        },
        "clear": {
          "description": "Обриши све своје API кључеве из базена."
        },
        "list": {
          "description": "Прикажи све API кључеве у свом базену (шифроване)."
        }
      },
      "explanation": {
        "body": "**Шта је API базен?**\nAPI базен је сигурна и анонимна колекција OpenAI API кључева. Омогућава Moderator Bot-у да настави са радом ефикасно, чак и када појединачни корисници наиђу на ограничења брзине.\n\n**Како функционише?**\n- Када додате свој OpenAI API кључ у базен, он се шифрује и безбедно чува.\n- Бот користи ове кључеве искључиво за приступ OpenAI моделима ради обављања задатака модерације.\n- Ваш API кључ остаје поверан; нико, укључујући програмере бота, не може да види.\n- Имате потпуну контролу и можете у било ком тренутку уклонити свој API кључ из базена.\n\n**Важно:** Да бисте допринели својим API кључем, ваш OpenAI налог мора да има најмање 5 долара у унапред плаћеном кредиту. Иако је модерацијски крајњи скуп бесплатан за употребу, OpenAI захтева да налози имају активне податке о наплати и квоту.\n\nДодавањем свог API кључа, помажете да Moderator Bot остане одговоран и ефикасан за све кориснике."
      },
      "add": {
        "invalid": "{error}",
        "duplicate": "Овај API кључ већ постоји у базену.",
        "success": "API кључ додат у базен."
      },
      "remove": {
        "success": "API кључ је уклоњен из вашег базена.",
        "missing": "Овај API кључ није пронађен у вашем базену. Користите /api_pool list да видите ваше тренутне API кључеве."
      },
      "clear": {
        "success": "Сви API кључеви су очишћени из вашег базена.",
        "empty": "Није пронађен ниједан API кључ за чишћење."
      },
      "list": {
        "header": "Ваши API кључеви:",
        "empty": "Није пронађен ниједан API кључ у вашем базену."
      }
    }
  }
}
