{
  "cogs": {
    "api_pool": {
      "meta": {
        "group_description": "Management of your personal API keys in the pool.",
        "explain": {
          "description": "Explain the API pool."
        },
        "add": {
          "description": "Add an API key to the pool.",
          "params": {
            "api_key": "The OpenAI API key to add to the shared pool."
          }
        },
        "remove": {
          "description": "Remove an API key from the pool.",
          "params": {
            "api_key": "The OpenAI API key to remove from the shared pool."
          }
        },
        "clear": {
          "description": "Clear all your API keys from the pool."
        },
        "list": {
          "description": "List all API keys in your pool (encrypted)."
        }
      },
      "explanation": {
        "body": "**Qu'est-ce que le Pool API ?**\nLe Pool API est une collection sécurisée et anonyme de clés API OpenAI partagées. Il permet au Bot de Modération de continuer à fonctionner efficacement, même lorsque des utilisateurs individuels atteignent des limites de taux.\n\n**Comment ça marche ?**\n- Lorsque vous ajoutez votre clé API OpenAI au pool, elle est cryptée et stockée de manière sécurisée.\n- Le bot utilise ces clés exclusivement pour accéder aux modèles OpenAI et réaliser des tâches de modération.\n- Votre clé API reste confidentielle ; personne, y compris les développeurs du bot, ne peut la consulter.\n- Vous gardez un contrôle total et pouvez retirer votre clé API du pool à tout moment.\n\n**Important :** Pour contribuer votre clé API, votre compte OpenAI doit avoir au moins 5 $ en crédits prépayés. Même si le point de terminaison de modération est gratuit à utiliser, OpenAI exige que les comptes aient des détails de facturation actifs et une quota. Vous pouvez ajouter du crédit à votre compte ici : <https://platform.openai.com/account/billing/overview>\n\nEn contribuant votre clé API, vous aidez à garantir que le Bot de Modération reste réactif et efficace pour tous les utilisateurs."
      },
      "add": {
        "invalid": "{erreur}",
        "duplicate": "Cette clé API existe déjà dans le pool.",
        "success": "Clé API ajoutée au pool."
      },
      "remove": {
        "success": "Clé API retirée de votre pool.",
        "missing": "Cette clé API n'a pas été trouvée dans votre pool. Utilisez /api_pool list pour voir vos clés API actuelles."
      },
      "clear": {
        "success": "Toutes les clés API ont été supprimées de votre pool.",
        "empty": "Aucune clé API trouvée à supprimer."
      },
      "list": {
        "header": "Vos clés API :",
        "empty": "Aucune clé API trouvée dans votre pool."
      }
    }
  }
}
