{
  "cogs": {
    "api_pool": {
      "meta": {
        "group_description": "إدارة مفاتيح API الخاصة بك في المجموعة.",
        "explain": {
          "description": "شرح تجمع API."
        },
        "add": {
          "description": "أضف مفتاح API إلى المجموعة.",
          "params": {
            "api_key": "مفتاح OpenAI API المطلوب إضافته للمجموعة المشتركة."
          }
        },
        "remove": {
          "description": "إزالة مفتاح API من المجموعة.",
          "params": {
            "api_key": "مفتاح OpenAI API المطلوب إزالته من المجموعة المشتركة."
          }
        },
        "clear": {
          "description": "مسح كافة مفاتيح API الخاصة بك من المجموعة."
        },
        "list": {
          "description": "عرض كافة مفاتيح API في مجموعتك (مشفرة)."
        }
      },
      "explanation": {
        "body": "**ما هو مجموعة واجهة برمجة التطبيق (API)؟**\nمجموعة API هي مجموعة آمنة ومجهولة المصدر لمفاتيح OpenAI API المشتركة. تمكن روبوت المشرف من الاستمرار في العمل بفعالية، حتى عندما يواجه المستخدمون الأفراد حدود المعدلات.\n\n**كيف تعمل؟**\n- عند إضافة مفتاح واجهة برمجة التطبيق الخاص بك إلى المجموعة، يتم تشفيره وتخزينه بأمان.\n- يستخدم الروبوت هذه المفاتيح حصريًا للوصول إلى نماذج OpenAI للقيام بمهام الإشراف.\n- يظل مفتاح API الخاص بك سريًا؛ لا يمكن لأحد، بما في ذلك مطوري الروبوت، الاطلاع عليه.\n- لديك السيطرة الكاملة ويمكنك إزالة مفتاح API الخاص بك من المجموعة في أي وقت.\n\n**هام:** للمساهمة بمفتاح واجهة برمجة التطبيق الخاص بك، يجب أن يكون لديك على الأقل 5 دولارات في رصيد مُسبق الدفع في حسابك على OpenAI. على الرغم من أن نقطة نهاية الإشراف مجانية للاستخدام، تطلب OpenAI من الحسابات توفر تفاصيل الفوترة النشطة وحدود الاستهلاك. يمكنك إضافة رصيد إلى حسابك هنا: <https://platform.openai.com/account/billing/overview>\n\nمن خلال المساهمة بمفتاح API الخاص بك، فإنك تساعد في ضمان أن يظل روبوت المشرف مستجيبًا وفعالًا لجميع المستخدمين."
      },
      "add": {
        "invalid": "{خطأ}",
        "duplicate": "هذا المفتاح API موجود بالفعل في المجموعة.",
        "success": "تم إضافة مفتاح API إلى المجموعة."
      },
      "remove": {
        "success": "تمت إزالة مفتاح API من مجموعتك.",
        "missing": "لم يتم العثور على هذا المفتاح API في مجموعتك. استخدم /api_pool list لرؤية مفاتيح API الحالية."
      },
      "clear": {
        "success": "تمت إزالة جميع مفاتيح API من مجموعتك.",
        "empty": "لم يتم العثور على مفاتيح API لإزالتها."
      },
      "list": {
        "header": "المفاتيح API الخاصة بك:",
        "empty": "لم يتم العثور على مفاتيح API في مجموعتك."
      }
    }
  }
}
