{
    "modules": {
        "config": {
            "settings_schema": {
                "locale": {
                    "invalid": "اللغة المحلية غير صالحة. اللغات المدعومة: {supported}",
                    "description": "تجاوز الكشف التلقائي عن الإعدادات المحلية باستخدام رمز إعدادات محلية محدد."
                },
                "nsfw_pfp_message": {
                    "default": "تم اكتشاف أن صورة ملفك الشخصي تحتوي على محتوى صريح",
                    "choices": [
                        "تم اكتشاف أن صورة ملفك الشخصي تحتوي على محتوى صريح",
                        "صورة ملفك الشخصي غير ملائمة لهذا الخادم.",
                        "تم تحديد صورة ملفك الشخصي كصورة غير آمنة للعمل (NSFW)."
                    ]
                },
                "rules": {
                    "default": [
                        "1. كون محترمًا — ممنوع التحرش أو خطاب الكراهية.",
                        "2. ممنوع المحتوى غير المناسب أو الفاحش.",
                        "3. ممنوع الرسائل المزعجة أو الترويج الذاتي المفرط.",
                        "4. اتبع شروط خدمة Discord."
                    ],
                    "description": "قواعد الخادم المستخدمة للإشراف التلقائي."
                },
                "vcmod_rules": {
                    "default": [
                        "1. ممنوع التحرش، أو خطاب الكراهية، أو التهديدات.",
                        "2. ممنوع الشتائم أو اللغة التمييزية.",
                        "3. ممنوع التحريض على العنف أو النشاطات الغير قانونية.",
                        "4. ممنوع المحتوى الجنسي أو التصريحات الصريحة.",
                        "5. اتبع شروط خدمة Discord."
                    ]
                },
                "strike-channel": {
                    "description": "القناة التي يتم فيها تسجيل المخالفات."
                },
                "aimod-debug": {
                    "description": "أرسل دائمًا رسالة تصحيح أخطاء مفصلة لإشراف AI إلى قناة مخالفات AI، بما في ذلك الرسائل المعلَّمة، قرار AI، والإجراءات المطبقة."
                },
                "nsfw-verbose": {
                    "description": "انشر رسالة مضمنة بتقرير فحص مفصل في نفس القناة التي تم نشر الوسائط المفحوصة فيها."
                },
                "nsfw-channel": {
                    "description": "القناة التي تُسجَّل فيها مخالفات NSFW مع معاينة للوسائط."
                },
                "nsfw-channel-notify": {
                    "description": "إرسال إشعار مضمن إلى القناة عند إزالة محتوى NSFW."
                },
                "nsfw-enabled": {
                    "description": "فعِّل فحص NSFW للرسائل والتفاعلات والصور الرمزية (لا تزال مفاتيح التبديل الأخرى سارية المفعول)."
                },
                "monitor-events": {
                    "description": "تفعيل/تعطيل التسجيل لكل نوع من أنواع الأحداث المراقبة."
                },
                "nsfw-detection-action": {
                    "description": "الإجراء الذي يجب اتخاذه عندما ينشر مستخدم محتوى NSFW."
                },
                "nsfw-detection-categories": {
                    "description": "الفئات المعتبرة NSFW لأغراض الكشف."
                },
                "nsfw-high-accuracy": {
                    "description": "فعّل عمليات فحص NSFW بدقة عالية للحصول على اكتشاف أكثر موثوقية. متاح لخطة Accelerated فقط."
                },
                "threshold": {
                    "description": "عتبة مستوى الثقة لاكتشاف NSFW. القيم المنخفضة أكثر حساسية."
                },
                "banned-words-action": {
                    "description": "الإجراء المتخذ عند نشر المستخدم كلمة محظورة."
                },
                "monitor-channel": {
                    "description": "قناة لتسجيل جميع أنشطة الخادم، بما في ذلك تعديلات الرسائل، حذف الرسائل، وأحداث انضمام/مغادرة المستخدمين."
                },
                "captcha-log-channel": {
                    "description": "القناة التي يتم فيها نشر سجلات التحقق من الكابتشا وتحديثات النشاط."
                },
                "aimod-channel": {
                    "description": "القناة التي تُنشر فيها سجلات مخالفات الذكاء الاصطناعي."
                },
                "cycle-strike-actions": {
                    "description": "التناوب بين إجراءات الإنذار عند نفاد الإجراءات التي يمكن تطبيقها على مستخدم."
                },
                "exclude-bannedwords-channels": {
                    "description": "القنوات المراد استثناؤها من رصد الكلمات المحظورة."
                },
                "strike-actions": {
                    "description": "إجراءات يجب اتخاذها لكل مستوى إنذار."
                },
                "strike-expiry": {
                    "description": "مدة استمرار الإنذار. استخدم صيغ مثل 20s, 30m, 2h, 30d, 2w, 5mo, 1y. ثواني، دقائق، ساعات، أيام، أسابيع، أشهر وسنوات على التوالي."
                },
                "dm-on-strike": {
                    "description": "إرسال رسالة خاصة إلى المستخدم عند تلقيه مخالفة."
                },
                "check-pfp": {
                    "description": "تحقق من صورة الملف الشخصي للمستخدم بحثًا عن محتوى NSFW."
                },
                "nsfw-pfp-action": {
                    "description": "الإجراء المتخذ عند قيام مستخدم بتعيين صورة ملف شخصي غير مناسبة للعمل (NSFW)."
                },
                "nsfw-pfp-message": {
                    "description": "الرسالة التي سيتم إرسالها عند وضع علامة على صورة الملف الشخصي للاعب.",
                    "default": "تم اكتشاف أن صورتك الشخصية تحتوي على محتوى صريح",
                    "choices": [
                        "تم اكتشاف أن صورتك الشخصية تحتوي على محتوى صريح",
                        "صورة ملفك الشخصي غير مناسبة لهذا الخادم.",
                        "تم وسم صورتك الشخصية على أنها NSFW."
                    ]
                },
                "unmute-on-safe-pfp": {
                    "description": "إلغاء مهلة المستخدم بمجرد تغيير صورته الشخصية إلى شيء مناسب."
                },
                "scan-age-restricted": {
                    "description": "فحص القنوات المقيّدة بالسن (NSFW). عند الإيقاف، يتم تخطي قنوات NSFW."
                },
                "check-tenor-gifs": {
                    "description": "تطبيق العقوبات عند اكتشاف محتوى NSFW في صور GIF من Tenor."
                },
                "use-default-banned-words": {
                    "description": "استخدام قائمة الألفاظ النابية المضمنة لهذا الخادم."
                },
                "exclude-channels": {
                    "description": "القنوات المطلوب استثناؤها من الكشف."
                },
                "delete-scam-messages": {
                    "description": "حذف الرسائل التي تطابق أنماط الاحتيال أو الروابط الاحتيالية تلقائيًا."
                },
                "scam-detection-action": {
                    "description": "الإجراء المتخذ عند اكتشاف رسالة احتيالية."
                },
                "check-links": {
                    "description": "فحص الروابط في الرسائل لاكتشاف البرمجيات الخبيثة والتصيّد الاحتيالي والاحتيال وما إلى ذلك."
                },
                "exclude-scam-channels": {
                    "description": "القنوات المطلوب استثناؤها من الكشف عن الاحتيال."
                },
                "aimod-detection-action": {
                    "description": "الإجراء المتخذ عند اكتشاف مخالفة من قِبل المشرف التلقائي. استخدم auto ليتخذ الذكاء الاصطناعي القرار."
                },
                "aimod-high-accuracy": {
                    "description": "استخدام إشراف ذكاء اصطناعي بدقة أعلى باستخدام gpt-5-mini (حوالي 2.25 دولار أمريكي لكل مليون رمز). يستهلك الميزانية الشهرية بشكل أسرع مقارنة بالإعداد الافتراضي."
                },
                "autonomous-mod": {
                    "description": "استخدم الذكاء الاصطناعي للإشراف تلقائيًا على خادمك بالكامل."
                },
                "aimod-check-interval": {
                    "description": "عدد مرات تشغيل عملية الإشراف بالذكاء الاصطناعي المجمّعة."
                },
                "aimod-mode": {
                    "description": "اختر كيفية تشغيل إشراف الذكاء الاصطناعي: وضع `report` (فقط عند الإشارة)، وضع `interval` (فحص تلقائي في الخلفية)، أو وضع `adaptive` (يتبدّل ديناميكيًا بناءً على نشاط الخادم أو الأحداث أو الإعدادات)."
                },
                "aimod-adaptive-events": {
                    "description": "اضبط الأحداث التي تؤدي إلى تبديل أوضاع إشراف الذكاء الاصطناعي."
                },
                "no-forward-from-role": {
                    "description": "منع رتبة محددة من إعادة توجيه الرسائل."
                },
                "banned-urls": {
                    "description": "عناوين URL أو نطاقات محددة لحظرها."
                },
                "url-detection-action": {
                    "description": "الإجراء المتخذ عند اكتشاف عنوان URL محظور."
                },
                "exclude-url-channels": {
                    "description": "القنوات المطلوب استثناؤها من عناوين URL المحظورة."
                },
                "vcmod-enabled": {
                    "description": "تمكين مراقبة القنوات الصوتية والنسخ."
                },
                "vcmod-channels": {
                    "description": "القنوات الصوتية المطلوب مراقبتها (عند تركها فارغة, لن تتم مراقبة أي قناة)."
                },
                "vcmod-listen-duration": {
                    "description": "مدة الاستماع النشط لكل قناة صوتية خلال دورة (مثال: 2m, 5m)."
                },
                "vcmod-idle-duration": {
                    "description": "مدة التوقف بين كل عملية نسخ في وضع التوفير."
                },
                "vcmod-saver-mode": {
                    "description": "وضع التوفير: يتنقل البوت بين القنوات الصوتية ليبدو نشطاً, لكنه لا يسجل ولا يستمع في معظم الوقت."
                },
                "vcmod-rules": {
                    "description": "القواعد المطبقة على مراقبة الدردشة الصوتية (منفصلة عن قواعد النص).",
                    "default": [
                        "1. ممنوع التحرش أو خطاب الكراهية أو التهديدات.",
                        "2. ممنوع الألفاظ المهينة أو اللغة التمييزية.",
                        "3. ممنوع التحريض على العنف أو الأنشطة غير القانونية.",
                        "4. ممنوع المحتوى الجنسي أو التصريحات الصريحة.",
                        "5. الالتزام بشروط خدمة Discord."
                    ]
                },
                "vcmod-detection-action": {
                    "description": "الإجراء المتخذ عند اكتشاف مخالفة بواسطة مراقبة الدردشة الصوتية. استخدم auto ليتخذ الذكاء الاصطناعي القرار."
                },
                "vcmod-high-accuracy": {
                    "description": "استخدام تحليل ذكاء اصطناعي بدقة أعلى لمراقبة الدردشة الصوتية (يستخدم ميزانية رموز أكبر)."
                },
                "vcmod-high-quality-transcription": {
                    "description": "تمكين نصوص صوتية أوضح عبر معالجة مميزة (تكلفة أعلى)."
                },
                "vcmod-transcript-channel": {
                    "description": "القناة التي تنشر فيها نصوص الدردشة الصوتية."
                },
                "vcmod-transcript-only": {
                    "description": "عند التمكين, سيكتفي البوت بنسخ الدردشة الصوتية دون تطبيق فحوصات قواعد الذكاء الاصطناعي أو إجراءات المراقبة. هذا يقلل استهلاك الميزانية بشكل كبير."
                },
                "captcha-verification-enabled": {
                    "description": "يتطلب من الأعضاء الجدد اجتياز اختبار كابتشا قبل منحهم الوصول."
                },
                "captcha-grace-period": {
                    "description": "المدة المتاحة للأعضاء الجدد لإكمال التحقق من الكابتشا (e.g. 10m, 1h)."
                },
                "captcha-success-actions": {
                    "description": "الإجراءات التي تُنفَّذ تلقائياً بعد نجاح التحقق."
                },
                "captcha-delivery-method": {
                    "description": "كيفية إرسال روابط التحقق من الكابتشا إلى الأعضاء الجدد (DM or embed)."
                },
                "captcha-embed-channel-id": {
                    "description": "القناة التي يُنشر فيها تضمين التحقق من الكابتشا عند استخدام طريقة التضمين."
                },
                "pre-captcha-roles": {
                    "description": "الأدوار الممنوحة للأعضاء الجدد قبل إكمال التحقق من الكابتشا."
                },
                "captcha-failure-actions": {
                    "description": "الإجراءات التي تُنفَّذ تلقائياً عند فشل العضو في التحقق من الكابتشا."
                }
            }
        }
    }
}
